In [1]:
import pandas as pd
e_data=pd.DataFrame()
print(e_data)

Empty DataFrame
Columns: []
Index: []

In [2]:
list=['a','b','c','d','w'] 
print(list)

['a', 'b', 'c', 'd', 'w']

In [4]:
d=pd.DataFrame(list)
print(d)

   0
0  a
1  b
2  c
3  d
4  w

In [6]:
l2=[[1,2,3,4,5],[6,7,8,9,0]]
d2=pd.DataFrame(l2)

print(d2)

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  0

In [8]:
l3=[[1,2,3,4,5],[6,7,8,9,0],['a','b','c','d','e']]  
d3=pd.DataFrame(l3)
print(d3)

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  0
2  a  b  c  d  e

In [11]:
di2={'ID':[1,2,3,4],'Name':['Sobia','Ali','Amna','Rimsha']} 
d5=pd.DataFrame(di2)
print(d5)

   ID    Name
0   1   Sobia
1   2     Ali
2   3    Amna
3   4  Rimsha

In [5]:
import pandas as pd

df = pd.read_csv("C:\\Users\\Hira Coder\\Downloads\\seattle-weather.csv")
print(df)

            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            8.6       4.4       1.7   2.9     rain
1457  2015-12-28            1.5       5.0       1.7   1.3     rain
1458  2015-12-29            0.0       7.2       0.6   2.6      fog
1459  2015-12-30            0.0       5.6      -1.0   3.4      sun
1460  2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [6]:
print(df.head())

         date  precipitation  temp_max  temp_min  wind  weather
0  2012-01-01            0.0      12.8       5.0   4.7  drizzle
1  2012-01-02           10.9      10.6       2.8   4.5     rain
2  2012-01-03            0.8      11.7       7.2   2.3     rain
3  2012-01-04           20.3      12.2       5.6   4.7     rain
4  2012-01-05            1.3       8.9       2.8   6.1     rain

In [7]:
print(df.tail())

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            8.6       4.4       1.7   2.9    rain
1457  2015-12-28            1.5       5.0       1.7   1.3    rain
1458  2015-12-29            0.0       7.2       0.6   2.6     fog
1459  2015-12-30            0.0       5.6      -1.0   3.4     sun
1460  2015-12-31            0.0       5.6      -2.1   3.5     sun

In [4]:
import pandas as pd
e_data=pd.DataFrame()
print(e_data)

Empty DataFrame
Columns: []
Index: []

In [8]:
l=["H","i","r","a","k","h","a","n"]
print (pd.DataFrame(l))

   0
0  H
1  i
2  r
3  a
4  k
5  h
6  a
7  n

In [9]:
l

['H', 'i', 'r', 'a', 'k', 'h', 'a', 'n']

In [14]:
l2=[["C","a","l","l"],["k","h","a","n"],["c","o","d","e"]]
print (pd.DataFrame(l2))

   0  1  2  3
0  C  a  l  l
1  k  h  a  n
2  c  o  d  e

In [16]:
list3=[[1,2,3,4,5],[4,5,6,7,8],['a','b','c','d','e']]  
print (pd.DataFrame(list3))

   0  1  2  3  4
0  1  2  3  4  5
1  4  5  6  7  8
2  a  b  c  d  e

In [22]:
d2={'ID ' :[1,2,3,4,5],'Name ':['Hira','Khan','Amna','Ali','Rim']}
d=(pd.DataFrame(d2))
print(d)

   ID  Name
0    1  Hira
1    2  Khan
2    3  Amna
3    4   Ali
4    5   Rim

In [24]:
list_d=[{'id':[1,2,3,4],'Number':[12,45,77,90]},{'Number':[12,45,77,90],'id':[9,8,3,4]}] 
d6=pd.DataFrame(list_d) 
print(d6)

             id            Number
0  [1, 2, 3, 4]  [12, 45, 77, 90]
1  [9, 8, 3, 4]  [12, 45, 77, 90]

In [29]:
ps = {
    'Id': pd.Series([1, 2, 3, 4]),
    'Name': pd.Series(['samad', 'Abc', 'Umer', 'Ahmad'])
}
print(ps)

#What is happening here?
#You are creating a Python dictionary named ps.
#The dictionary has two keys: "Id" and "Name".
#Each key maps to a pandas Series object.

#'Id' : pd.Series([1,2,3,4])
#→ Creates a pandas Series containing numbers [1,2,3,4].
#'Name' : pd.Series(['A samad','Abc','Umer','Ahmad'])
#→ Creates a pandas Series containing strings ['A samad','Abc','Umer','Ahmad'].#

{'Id': 0    1
1    2
2    3
3    4
dtype: int64, 'Name': 0    samad
1      Abc
2     Umer
3    Ahmad
dtype: object}

In [30]:
d2=pd.DataFrame(ps)
print (d2)

   Id   Name
0   1  samad
1   2    Abc
2   3   Umer
3   4  Ahmad

In [37]:
#df=pd.read_csv("C:\\Users\\Hira Coder\\Downloads\\insurance.csv")
#print(df)

In [41]:
#df.head()

In [40]:
#df.tail()

In [49]:
df2=pd.DataFrame({'ID':[1,2,3,4] , 'Name':['H','I','R','A']})
print(df2)
df3=pd.DataFrame({'ID':[1,2,7,8] , 'Name':['H','I','A','N']})
print(df3)

   ID Name
0   1    H
1   2    I
2   3    R
3   4    A
   ID Name
0   1    H
1   2    I
2   7    A
3   8    N

In [50]:
pd.merge(df2,df3)   #By default, pd.merge() tries to join on common column names and their values if placed in same id.

   ID Name
0   1    H
1   2    I

In [51]:
df2=pd.DataFrame({'ID':[1,2,3,4] , 'Name':['H','I','R','A']})
print(df2)
df3=pd.DataFrame({'ID':[5,6,7,8] , 'Name':['K','H','A','N']})
print(df3)

   ID Name
0   1    H
1   2    I
2   3    R
3   4    A
   ID Name
0   5    K
1   6    H
2   7    A
3   8    N

In [52]:
pd.merge(df2,df3, left_index=True, right_index=True)  
#→ joins row by row using index.

#left_index=True, right_index=True
#Means#:
#Column values compare mat karo.
#Instead, rows ke index numbers (0,1,2,3 …) ke basis par merge karo.

   ID_x Name_x  ID_y Name_y
0     1      H     5      K
1     2      I     6      H
2     3      R     7      A
3     4      A     8      N

In [56]:
df4=pd.DataFrame({'ID':[7,8,11,12],'Name':['C','O','D','E']})
print(df4)

   ID Name
0   7    C
1   8    O
2  11    D
3  12    E

In [57]:
pd.merge(df3,df4, on='ID')  
# same id hona zarori ha dono datasets mai wrna empty data frame ayee gaa

   ID Name_x Name_y
0   7      A      C
1   8      N      O

In [60]:
pd.merge(df3,df4, on='ID', suffixes=('_First','_Second'))  
#Jab dono DataFrames me same naam ke columns hote hain (other than the join key "ID"),tab merge ke baad confusion ho sakta hai.
# confusuion sy bachany k liyee to suffixes ka use krty ha same names ma
#Same column names ke saath ek suffix add karna taake unko differentiate kiya ja sake.

   ID Name_First Name_Second
0   7          A           C
1   8          N           O

In [62]:
sr1 = pd.Series([0,1,2])  
sr1

0    0
1    1
2    2
dtype: int64

In [63]:
sr2 = pd.Series([3,4,5])  
sr2

0    3
1    4
2    5
dtype: int64

In [64]:
#pd.Series → ek 1D array (list jaisa) object hota hai pandas me, jisme values ke saath ek index (row labels) bhi hota hai.
#sr1 aur sr2 dono alag-alag Series hai

#Left side (0,1,2) → index (row numbers).
#Right side (0,1,2 and 3,4,5) → actual values.
#dtype: int64 → data type integers hain.

In [66]:
pd.concat([sr1,sr2],axis=1)

   0  1
0  0  3
1  1  4
2  2  5

In [67]:
sr1 = pd.Series([0,1,2])  
sr2 = pd.Series([3,4,5])  

# Combine into DataFrame
df = pd.DataFrame({
    'First': sr1,
    'Second': sr2
})

print(df)

   First  Second
0      0       3
1      1       4
2      2       5

In [75]:
df6=pd.DataFrame({'ID':[1,2,3,4],'Name':['a','b','c','d'],'Class':['s','t','u','v']})
print(df6)

   ID Name Class
0   1    a     s
1   2    b     t
2   3    c     u
3   4    d     v

In [76]:
df7=pd.DataFrame({'ID':[5,6,7,8],'Name':['e','f','g','h'],'Class':['w','x','y','z']})
print(df7)

   ID Name Class
0   5    e     w
1   6    f     x
2   7    g     y
3   8    h     z

In [79]:
pd.concat([df6,df7])  #this combine column wise

   ID Name Class
0   1    a     s
1   2    b     t
2   3    c     u
3   4    d     v
0   5    e     w
1   6    f     x
2   7    g     y
3   8    h     z

In [80]:
pd.concat([df6,df7],axis=1)  # to combine horizontally

#axis=0 → neeche add karo → rows ka kaam hai

#axis=1 → side-by-side add karo → columns ka kaam hai

   ID Name Class  ID Name Class
0   1    a     s   5    e     w
1   2    b     t   6    f     x
2   3    c     u   7    g     y
3   4    d     v   8    h     z

In [84]:
pd.concat([df6,df7], ignore_index=True)  

#ignore_index=True ka kaam hai old index ko drop kar dena aur naye continuous index assign karna.
#ignore_index=False (default) → old index preserve hoga (repeat bhi ho sakta hai).
#ignore_index=True → old index hata kar naya sequential index assign hota hai.

   ID Name Class
0   1    a     s
1   2    b     t
2   3    c     u
3   4    d     v
4   5    e     w
5   6    f     x
6   7    g     y
7   8    h     z

In [85]:
df8=pd.DataFrame({'ID':[1,2,3,4],'Name':['a','b','c','d'],'Class':['s','t','u','v']})
print(df8)

   ID Name Class
0   1    a     s
1   2    b     t
2   3    c     u
3   4    d     v

In [90]:
df9=pd.DataFrame({'ID':[5,6,7,8],'Name':['e','f','g','h'],'Class':['w','x','y','z']})
print(df7)

   ID Name Class
0   5    e     w
1   6    f     x
2   7    g     y
3   8    h     z

In [93]:
pd.concat([df8,df9], axis=1, join='outer', keys=['Student','Tecaher'])  

#axis=1
#Side by side concat hoga (columns ke saath).
#join='outer'
#Indexes ka union hoga.
#Yahan dono dataframes ke indexes 0,1,2,3 hain → isliye union bhi [0,1,2,3].
#Jahan data missing hoga, NaN fill hoga.
#keys=['Student','Teacher']
#Multi-level column headers banenge:
#Pehla level: "Student" aur "Teacher"
#Dusra level: unke apne column names (ID, Name, Class)

  Student            Tecaher
       ID Name Class      ID Name Class
0       1    a     s       5    e     w
1       2    b     t       6    f     x
2       3    c     u       7    g     y
3       4    d     v       8    h     z

In [97]:
df10=pd.DataFrame({ 'A':[1,2,3,4],'B':[11,12,13,14]}, index=['a','b','c','d'])  
print(df10)
# index custom kr lia ha numbers ki jagah letters

   A   B
a  1  11
b  2  12
c  3  13
d  4  14

In [98]:
df11=pd.DataFrame({ 'C':[5,6],'D':[11,12]},index=['a','b']) 
print(df11)

   C   D
a  5  11
b  6  12

In [101]:
df10.join(df11)  
#Base hamesha df10 ke index hote hain (kyunki tumne df10.join(...) likha).
#Pandas har ek index (a,b,c,d) uthata hai aur check karta hai:
#Row "a" → dono me hai → merge kardo.
#Row "b" → dono me hai → merge kardo.
#Row "c" → sirf df10 me hai → df11 me nahi → NaN.
#Row "d" → sirf df10 me hai → df11 me nahi → NaN.

   A   B    C     D
a  1  11  5.0  11.0
b  2  12  6.0  12.0
c  3  13  NaN   NaN
d  4  14  NaN   NaN

In [102]:
df11.join(df10)  
# is m do rows is loye ayi q k base index hm ny df11 ko bnaya tha

   C   D  A   B
a  5  11  1  11
b  6  12  2  12

In [103]:
#lsuffix → left (pehle wale DataFrame) ke duplicate columns ko suffix do.
#rsuffix → right (baad wale DataFrame) ke duplicate columns ko suffix do.
#Matlab agar dono dataframes me same column names hain, to suffix use karke unko alag-alag bana sakte ho.

In [108]:
f1=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]},index=['a','b','c','d'])
print(f1)

   A  B
a  1  5
b  2  6
c  3  7
d  4  8

In [109]:
f2=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]},index=['a','b','c','d'])
print(f2)

   A  B
a  1  5
b  2  6
c  3  7
d  4  8

In [111]:
f1.join(f2,lsuffix='1')

   A1  B1  A  B
a   1   5  1  5
b   2   6  2  6
c   3   7  3  7
d   4   8  4  8

In [112]:
f1.join(f2,rsuffix='1')

   A  B  A1  B1
a  1  5   1   5
b  2  6   2   6
c  3  7   3   7
d  4  8   4   8

In [113]:
import numpy as np
from numpy.linalg import inv   # inv = inverse function

a = np.array([[1,2],
              [5,6]])   # 2x2 matrix

Q = inv(a)   # Inverse of 'a'
print(Q)

[[-1.5   0.5 ]
 [ 1.25 -0.25]]